{
    "title": "Untitled Story",
    "data": {
        "stitches": {
            "theNightWasUnusu": {
                "content": [
                    "The night was unusually quiet, the kind of stillness that made every creak of the floorboards echo through the house. Stella was about to lock the front door when she noticed a small package on the porch. No delivery van had been seen, and the package bore no return address just her name scrawled in hurried handwriting. Inside was a single, old-fashioned key wrapped in black velvet and a note:\"You’ve been chosen. The clock is ticking. Midnight. Follow the key.”Stella felt a shiver run down her spine as she stared at the key. She had no idea who could have left this, or why she was involved, but something about the whole situation felt...urgent. What should Stella do? Choose from the option below",
                    {
                        "option": "A. Investigate the key.",
                        "linkPath": "stellasCuriosity1",
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Ignore it and stay alert",
                        "linkPath": "stellaHesitatedS",
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "pageNum": 1
                    },
                    {
                        "pageLabel": "The Strange Arrival"
                    }
                ]
            },
            "stellaHesitatedS": {
                "content": [
                    "Stella hesitated. Something about the key felt wrong, and she wasn’t sure if she was ready to face whatever it represented. She left it on the porch and took a step back, keeping her gaze fixed on the street. She decided to stay alert, watching for anything unusual. Minutes ticked by, and the only sound was the rustling of leaves in the wind. But then, something caught her eye. From the shadows, she saw a figure moving in the distance. It wasn’t a neighbor, no one she recognized. The person was walking slowly, purposefully, their face hidden beneath the brim of a hat. Her heart raced. Was it someone who had been watching her? Or just a passerby? Either way, Stella couldn’t shake the feeling that something strange was unfolding right outside her door. What should Stella do?",
                    {
                        "option": "A. Approach the figure and confront them.",
                        "linkPath": "stellasCuriosity",
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Stay hidden and continue watching from the shadows.",
                        "linkPath": "stellaKeptToTheS",
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "pageNum": 2
                    },
                    {
                        "pageLabel": "Ignore it and stay alert"
                    }
                ]
            },
            "stellaKeptToTheS": {
                "content": [
                    "Stella kept to the shadows, holding her breath as she observed the figure. They stood still for a moment, seemingly scanning the area, then reached into their coat and pulled out a small object. With a flick of their wrist, they tossed it onto her porch. The metallic clink echoed in the still night air. Stella’s eyes widened as the figure adjusted their hat and began walking away, heading toward the edge of the street.  As soon as the figure was out of sight, Stella stepped forward to examine what had been left behind. It was a coin, old and weathered, its surface etched with symbols she couldn’t recognize.  A faint whisper, barely audible, seemed to emanate from it:  *-\"Find me before midnight.\"-* What should Stella do?",
                    {
                        "option": "A. Follow the figure to see where they’re going.",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Examine the coin in the safety of her home.",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "pageNum": 3
                    },
                    {
                        "pageLabel": "Stay Hidden"
                    }
                ]
            },
            "stellasCuriosity": {
                "content": [
                    "Stella’s curiosity overpowered her caution. With the key still in her pocket, she stepped out from the shadows and called out, “Hey! Who are you? Why are you here?”  The figure froze, then slowly turned toward her. The wide-brimmed hat cast their face in shadow, but Stella could make out piercing eyes glinting in the dim light. They didn’t respond but instead tilted their head, almost as if amused.  “You shouldn’t have come,” they said finally, their voice low and gravelly.  Before Stella could respond, the figure tossed something small and metallic toward her. She flinched as it clattered to the ground near her feet. It was a coin, old and weathered, with strange symbols etched into its surface.  “Midnight,” the figure whispered. Then they turned and disappeared into the shadows as though they had never been there. What should Stella do?   ",
                    {
                        "option": " A. Pick up the coin and examine it closely.",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Leave the coin and focus on finding out where the figure went.",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "pageNum": 4
                    },
                    {
                        "pageLabel": "Approach the Figure"
                    }
                ]
            },
            "stellasCuriosity1": {
                "content": [
                    "Stella’s curiosity couldn’t be contained. The key felt heavier in her hand as she stepped outside, her mind racing with questions. She glanced around, but the street was empty and silent. There was no sign of anyone nearby. With a deep breath, she started walking, the cool night air biting at her skin. Her eyes darted around, looking for anything that might give her a clue about where the key fit. After a few moments, she noticed a small, old-fashioned door at the side of her neighbor's house one that had been there for as long as she could remember, but always seemed to stay locked. She approached the door cautiously, the key trembling slightly in her hand. She inserted it into the lock and turned. The door creaked open, revealing a dimly lit hallway leading into darkness. It wasn’t a room she recognized. Something didn’t feel right, but the mystery tugged at her. What should Stella do?",
                    {
                        "runOn": true
                    },
                    {
                        "option": "A. Step inside and explore what lies within.",
                        "linkPath": "withTremblingHan",
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Close the door and retreat, unsure whether to trust what’s ahead.",
                        "linkPath": "stellaHesitatedF",
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "flagName": "section 1a - investigate the key."
                    },
                    {
                        "pageNum": 5
                    },
                    {
                        "pageLabel": "Investigate the key"
                    }
                ]
            },
            "stellaHesitatedF": {
                "content": [
                    "Stella hesitated for only a moment before retreating. She shut the door carefully, the key still in her hand. Something about that hallway felt wrong too inviting, too deliberate.  She stepped back into the night and glanced around her quiet neighborhood. Everything seemed still, but a faint sound caught her attention: footsteps on the sidewalk.  At the edge of the street stood a figure in a dark coat, their face obscured by shadow. They paused and tilted their head, as if listening, before continuing toward the end of the block. What should Stella do?  ",
                    {
                        "option": "A. Follow the figure and determined to find out who they are.  ",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Stay hidden and watch to see what they do next.",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "pageNum": 6
                    },
                    {
                        "pageLabel": "Close the door"
                    }
                ]
            },
            "withTremblingHan": {
                "content": [
                    "With trembling hands, Stella stepped through the doorway. The air beyond was colder, and a strange sense of unease prickled her skin. The room on the other side wasn’t what she expected—it looked like an abandoned office, with old filing cabinets and a dusty desk under a dim, flickering light.  The key in her hand suddenly felt warm, almost as though it were reacting to something nearby. On the desk lay a journal, open to a page scrawled with strange symbols and a single line of text:  *-\"The key remembers. Trust it.\"-*  A soft creak echoed behind her. Stella spun around, but the door had shut on its own. The lock clicked, trapping her inside. What should Stella do?",
                    {
                        "option": "A. Examine the journal and try to decipher the symbols.",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "option": "B. Search the room for another way out. ",
                        "linkPath": null,
                        "ifConditions": null,
                        "notIfConditions": null
                    },
                    {
                        "pageNum": 7
                    },
                    {
                        "pageLabel": "Step inside and explore"
                    }
                ]
            }
        },
        "initial": "theNightWasUnusu",
        "optionMirroring": true,
        "allowCheckpoints": false,
        "editorData": {
            "playPoint": "stellasCuriosity1",
            "libraryVisible": false,
            "authorName": "Anonymous",
            "textSize": 0
        }
    }
}